Hyooki/STM32DUINO_GAMEPAD/variants/pindefinition_examples/Official NUCLEO-L073RZ.c

enum {
//*=default , +=alternate
//PIN    |BOARD LABEL         |I2C1|I2C2|I2C3|SPI1 |SPI2 |USART1|USART2|USART4|USART5|TIM (PWM)                       |USB|RCC       |SYS    
PA0 , // |                    |    |    |    |     |     |      |      |*TX   |      |*TIM2_CH1                       |   |          |       
PA1 , // |                    |    |    |    |     |     |      |      |*RX   |      |*TIM2_CH2                       |   |          |       
PA2 , // |USART_TX            |    |    |    |     |     |      |*TX   |      |      |*TIM21_CH1 *TIM2_CH3            |   |          |       
PA3 , // |USART_RX            |    |    |    |     |     |      |*RX   |      |      |*TIM21_CH2 *TIM2_CH4            |   |          |       
PA4 , // |                    |    |    |    |     |     |      |      |      |      |                                |   |          |       
PA5 , // |LD2 [Green Led]     |    |    |    |*SCK |     |      |      |      |      |+TIM2_CH1                       |   |          |       
PA6 , // |                    |    |    |    |*MISO|     |      |      |      |      |*TIM3_CH1 *TIM22_CH1            |   |          |       
PA7 , // |                    |    |    |    |*MOSI|     |      |      |      |      |*TIM3_CH2 *TIM22_CH2            |   |          |       
PA8 , // |                    |    |    |+SCL|     |     |      |      |      |      |                                |   |          |       
PA9 , // |                    |*SCL|    |    |     |     |*TX   |      |      |      |                                |   |          |       
PA10, // |                    |*SDA|    |    |     |     |*RX   |      |      |      |                                |   |          |       
PA11, // |                    |    |    |    |+MISO|     |      |      |      |      |                                |*DM|          |       
PA12, // |                    |    |    |    |+MOSI|     |      |      |      |      |                                |*DP|          |       
PA13, // |TMS                 |    |    |    |     |     |      |      |      |      |                                |   |          |*SWDIO 
PA14, // |TCK                 |    |    |    |     |     |      |+TX   |      |      |                                |   |          |*SWCLK 
PA15, // |                    |    |    |    |     |     |      |+RX   |      |      |+TIM2_CH1                       |   |          |       
PB0 , // |                    |    |    |    |     |     |      |      |      |      |*TIM3_CH3                       |   |          |       
PB1 , // |                    |    |    |    |     |     |      |      |      |      |*TIM3_CH4                       |   |          |       
PB2 , // |                    |    |    |    |     |     |      |      |      |      |                                |   |          |       
PB3 , // |                    |    |    |    |+SCK |     |      |      |      |+TX   |+TIM2_CH2                       |   |          |       
PB4 , // |                    |    |    |+SDA|+MISO|     |      |      |      |+RX   |+TIM3_CH1 +TIM22_CH1            |   |          |       
PB5 , // |                    |    |    |    |+MOSI|     |      |      |      |      |+TIM3_CH2 +TIM22_CH2 +LPTIM1_IN1|   |          |       
PB6 , // |                    |+SCL|    |    |     |     |+TX   |      |      |      |                                |   |          |       
PB7 , // |                    |+SDA|    |    |     |     |+RX   |      |      |      |+LPTIM1_IN2                     |   |          |*PVD_IN
PB8 , // |                    |+SCL|    |    |     |     |      |      |      |      |                                |   |          |       
PB9 , // |                    |+SDA|    |    |     |     |      |      |      |      |                                |   |          |       
PB10, // |                    |    |*SCL|    |     |*SCK |      |      |      |      |+TIM2_CH3                       |   |          |       
PB11, // |                    |    |*SDA|    |     |     |      |      |      |      |+TIM2_CH4                       |   |          |       
PB12, // |                    |    |    |    |     |     |      |      |      |      |                                |   |          |       
PB13, // |                    |    |+SCL|    |     |+SCK |      |      |      |      |+TIM21_CH1                      |   |          |       
PB14, // |                    |    |+SDA|    |     |+MISO|      |      |      |      |+TIM21_CH2                      |   |          |       
PB15, // |                    |    |    |    |     |+MOSI|      |      |      |      |                                |   |          |       
PC0 , // |                    |    |    |*SCL|     |     |      |      |      |      |*LPTIM1_IN1                     |   |          |       
PC1 , // |                    |    |    |*SDA|     |     |      |      |      |      |                                |   |          |       
PC2 , // |                    |    |    |    |     |*MISO|      |      |      |      |*LPTIM1_IN2                     |   |          |       
PC3 , // |                    |    |    |    |     |*MOSI|      |      |      |      |                                |   |          |       
PC4 , // |                    |    |    |    |     |     |      |      |      |      |                                |   |          |       
PC5 , // |                    |    |    |    |     |     |      |      |      |      |                                |   |          |       
PC6 , // |                    |    |    |    |     |     |      |      |      |      |+TIM3_CH1 +TIM22_CH1            |   |          |       
PC7 , // |                    |    |    |    |     |     |      |      |      |      |+TIM3_CH2 +TIM22_CH2            |   |          |       
PC8 , // |                    |    |    |    |     |     |      |      |      |      |+TIM3_CH3                       |   |          |       
PC9 , // |                    |    |    |+SDA|     |     |      |      |      |      |+TIM3_CH4                       |   |          |       
PC10, // |                    |    |    |    |     |     |      |      |+TX   |      |                                |   |          |       
PC11, // |                    |    |    |    |     |     |      |      |+RX   |      |                                |   |          |       
PC12, // |                    |    |    |    |     |     |      |      |      |*TX   |                                |   |          |       
PC13, // |B1 [Blue PushButton]|    |    |    |     |     |      |      |      |      |                                |   |          |       
PC14, // |                    |    |    |    |     |     |      |      |      |      |                                |   |*OSC32_IN |       
PC15, // |                    |    |    |    |     |     |      |      |      |      |                                |   |*OSC32_OUT|       
PD2 , // |                    |    |    |    |     |     |      |      |      |*RX   |                                |   |          |       
PH0 , // |MCO                 |    |    |    |     |     |      |      |      |      |                                |   |*OSC_IN   |       
PH1 , // |                    |    |    |    |     |     |      |      |      |      |                                |   |*OSC_OUT  |       
NB_DIGITAL_PINS,
};

#include "stm32f1xx_hal.h"
#include "spi_com.h"
#include "twi.h"
#include "uart.h"
#include "analog.h"
#include "variant.h"

extern const PinDescription g_APinDescription[]=
{
  { PA0 , GPIO_PIN_0 , GPIOA, GPIO_PIN_IO, false},
  { PA1 , GPIO_PIN_1 , GPIOA, GPIO_PIN_IO, false},
  { PA2 , GPIO_PIN_2 , GPIOA, GPIO_PIN_IO, false},
  { PA3 , GPIO_PIN_3 , GPIOA, GPIO_PIN_IO, false},
  { PA4 , GPIO_PIN_4 , GPIOA, GPIO_PIN_IO, false},
  { PA5 , GPIO_PIN_5 , GPIOA, GPIO_PIN_IO, false},
  { PA6 , GPIO_PIN_6 , GPIOA, GPIO_PIN_IO, false},
  { PA7 , GPIO_PIN_7 , GPIOA, GPIO_PIN_IO, false},
  { PA8 , GPIO_PIN_8 , GPIOA, GPIO_PIN_IO, false},
  { PA9 , GPIO_PIN_9 , GPIOA, GPIO_PIN_IO, false},
  { PA10, GPIO_PIN_10, GPIOA, GPIO_PIN_IO, false},
  { PA11, GPIO_PIN_11, GPIOA, GPIO_PIN_IO, false},
  { PA12, GPIO_PIN_12, GPIOA, GPIO_PIN_IO, false},
  { PA13, GPIO_PIN_13, GPIOA, GPIO_PIN_IO, false},
  { PA14, GPIO_PIN_14, GPIOA, GPIO_PIN_IO, false},
  { PA15, GPIO_PIN_15, GPIOA, GPIO_PIN_IO, false},
  { PB0 , GPIO_PIN_0 , GPIOB, GPIO_PIN_IO, false},
  { PB1 , GPIO_PIN_1 , GPIOB, GPIO_PIN_IO, false},
  { PB2 , GPIO_PIN_2 , GPIOB, GPIO_PIN_IO, false},
  { PB3 , GPIO_PIN_3 , GPIOB, GPIO_PIN_IO, false},
  { PB4 , GPIO_PIN_4 , GPIOB, GPIO_PIN_IO, false},
  { PB5 , GPIO_PIN_5 , GPIOB, GPIO_PIN_IO, false},
  { PB6 , GPIO_PIN_6 , GPIOB, GPIO_PIN_IO, false},
  { PB7 , GPIO_PIN_7 , GPIOB, GPIO_PIN_IO, false},
  { PB8 , GPIO_PIN_8 , GPIOB, GPIO_PIN_IO, false},
  { PB9 , GPIO_PIN_9 , GPIOB, GPIO_PIN_IO, false},
  { PB10, GPIO_PIN_10, GPIOB, GPIO_PIN_IO, false},
  { PB11, GPIO_PIN_11, GPIOB, GPIO_PIN_IO, false},
  { PB12, GPIO_PIN_12, GPIOB, GPIO_PIN_IO, false},
  { PB13, GPIO_PIN_13, GPIOB, GPIO_PIN_IO, false},
  { PB14, GPIO_PIN_14, GPIOB, GPIO_PIN_IO, false},
  { PB15, GPIO_PIN_15, GPIOB, GPIO_PIN_IO, false},
  { PC0 , GPIO_PIN_0 , GPIOC, GPIO_PIN_IO, false},
  { PC1 , GPIO_PIN_1 , GPIOC, GPIO_PIN_IO, false},
  { PC2 , GPIO_PIN_2 , GPIOC, GPIO_PIN_IO, false},
  { PC3 , GPIO_PIN_3 , GPIOC, GPIO_PIN_IO, false},
  { PC4 , GPIO_PIN_4 , GPIOC, GPIO_PIN_IO, false},
  { PC5 , GPIO_PIN_5 , GPIOC, GPIO_PIN_IO, false},
  { PC6 , GPIO_PIN_6 , GPIOC, GPIO_PIN_IO, false},
  { PC7 , GPIO_PIN_7 , GPIOC, GPIO_PIN_IO, false},
  { PC8 , GPIO_PIN_8 , GPIOC, GPIO_PIN_IO, false},
  { PC9 , GPIO_PIN_9 , GPIOC, GPIO_PIN_IO, false},
  { PC10, GPIO_PIN_10, GPIOC, GPIO_PIN_IO, false},
  { PC11, GPIO_PIN_11, GPIOC, GPIO_PIN_IO, false},
  { PC12, GPIO_PIN_12, GPIOC, GPIO_PIN_IO, false},
  { PC13, GPIO_PIN_13, GPIOC, GPIO_PIN_IO, false},
  { PC14, GPIO_PIN_14, GPIOC, GPIO_PIN_IO, false},
  { PC15, GPIO_PIN_15, GPIOC, GPIO_PIN_IO, false},
  { PD2 , GPIO_PIN_2 , GPIOD, GPIO_PIN_IO, false},
  { PH0 , GPIO_PIN_0 , GPIOH, GPIO_PIN_IO, false},
  { PH1 , GPIO_PIN_1 , GPIOH, GPIO_PIN_IO, false},
};



spi_init_info_t spi_init_info[] = { 
  { 
    .init_done = 0, 
    .spi_instance = SPI1, 
    .mosi_alternate = GPIO_AF0_SPI1,
    .mosi_port = GPIOA, 
    .mosi_pin =  GPIO_PIN_7, 
    .miso_alternate = GPIO_AF0_SPI1,
    .miso_port = GPIOA, 
    .miso_pin = GPIO_PIN_6, 
    .sck_alternate = GPIO_AF0_SPI1,
    .sck_port = GPIOA, 
    .sck_pin = GPIO_PIN_5, 
  },
  { 
    .init_done = 0, 
    .spi_instance = SPI2, 
    .mosi_alternate = GPIO_AF2_SPI2,
    .mosi_port = GPIOC, 
    .mosi_pin =  GPIO_PIN_3, 
    .miso_alternate = GPIO_AF2_SPI2,
    .miso_port = GPIOC, 
    .miso_pin = GPIO_PIN_2, 
    .sck_alternate = GPIO_AF5_SPI2,
    .sck_port = GPIOB, 
    .sck_pin = GPIO_PIN_10, 
  },
}; 

uint8_t NB_SPI_INSTANCES = sizeof(spi_init_info) / sizeof(spi_init_info[0]);

i2c_init_info_t g_i2c_init_info[] = {
  {
    .init_done = 0,
    .i2c_instance = I2C1,
    .irq = I2C1_EV_IRQn,
    .sda_alternate = GPIO_AF6_I2C1,
    .sda_port = GPIOA,
    .sda_pin = GPIO_PIN_10,
    .scl_alternate = GPIO_AF6_I2C1,
    .scl_port = GPIOA,
    .scl_pin = GPIO_PIN_9,
    .i2c_onSlaveReceive = NULL,
    .i2c_onSlaveTransmit = NULL,
    .i2cTxRxBufferSize = 0
  },
  {
    .init_done = 0,
    .i2c_instance = I2C2,
    .irq = I2C2_EV_IRQn,
    .sda_alternate = GPIO_AF6_I2C2,
    .sda_port = GPIOB,
    .sda_pin = GPIO_PIN_11,
    .scl_alternate = GPIO_AF6_I2C2,
    .scl_port = GPIOB,
    .scl_pin = GPIO_PIN_10,
    .i2c_onSlaveReceive = NULL,
    .i2c_onSlaveTransmit = NULL,
    .i2cTxRxBufferSize = 0
  },
  {
    .init_done = 0,
    .i2c_instance = I2C3,
    .irq = I2C3_EV_IRQn,
    .sda_alternate = GPIO_AF7_I2C3,
    .sda_port = GPIOC,
    .sda_pin = GPIO_PIN_1,
    .scl_alternate = GPIO_AF7_I2C3,
    .scl_port = GPIOC,
    .scl_pin = GPIO_PIN_0,
    .i2c_onSlaveReceive = NULL,
    .i2c_onSlaveTransmit = NULL,
    .i2cTxRxBufferSize = 0
  },
};

uint8_t NB_I2C_INSTANCES = sizeof(g_i2c_init_info) / sizeof(g_i2c_init_info[0]);


uart_conf_t g_uart_config[] = {
  {
    //UART ID and IRQ
    .usart_typedef = USART1, .irqtype = USART1_IRQn,
    .tx_port = GPIOA, .tx_pin = GPIO_PIN_9,
    .rx_port = GPIOA, .rx_pin = GPIO_PIN_10,
    .uart_af_remap = GPIO_AF4_USART1,
    .tx_alternate  = GPIO_AF4_USART1,
    .rx_alternate  = GPIO_AF4_USART1,
    .data_available = 0,
    .begin = 0,
    .end = 0,
    .uart_option = NATIVE_UART_E
  },
  {
    //UART ID and IRQ
    .usart_typedef = USART2, .irqtype = USART2_IRQn,
    .tx_port = GPIOA, .tx_pin = GPIO_PIN_2,
    .rx_port = GPIOA, .rx_pin = GPIO_PIN_3,
    .uart_af_remap = GPIO_AF4_USART2,
    .tx_alternate  = GPIO_AF4_USART2,
    .rx_alternate  = GPIO_AF4_USART2,
    .data_available = 0,
    .begin = 0,
    .end = 0,
    .uart_option = NATIVE_UART_E
  },
  {
    //UART ID and IRQ
    .usart_typedef = USART4, .irqtype = USART4_IRQn,
    .tx_port = GPIOA, .tx_pin = GPIO_PIN_0,
    .rx_port = GPIOA, .rx_pin = GPIO_PIN_1,
    .uart_af_remap = GPIO_AF6_USART4,
    .tx_alternate  = GPIO_AF6_USART4,
    .rx_alternate  = GPIO_AF6_USART4,
    .data_available = 0,
    .begin = 0,
    .end = 0,
    .uart_option = NATIVE_UART_E
  },
  {
    //UART ID and IRQ
    .usart_typedef = USART5, .irqtype = USART5_IRQn,
    .tx_port = GPIOC, .tx_pin = GPIO_PIN_12,
    .rx_port = GPIOD, .rx_pin = GPIO_PIN_2,
    .uart_af_remap = GPIO_AF2_USART5,
    .tx_alternate  = GPIO_AF2_USART5,
    .rx_alternate  = GPIO_AF6_USART5,
    .data_available = 0,
    .begin = 0,
    .end = 0,
    .uart_option = NATIVE_UART_E
  },
};

uint8_t NB_UART_MANAGED = sizeof(g_uart_config) / sizeof(g_uart_config[0]);

UART_HandleTypeDef g_UartHandle[sizeof(g_uart_config) / sizeof(g_uart_config[0])];


#define SAMPLINGTIME  ADC_SAMPLETIME_1CYCLE_5  /*!< ADC conversions sampling time. */

adc_config_str g_adc_config[] = {
};
